# **Sujet centrale Informatique 2016: Prévision des collisions aériennes**

**Importation des modules nécessaires**

In [33]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [58]:
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\jeffrey.verdiere\documents\sujet centrale info\venv\lib\site-packages (from pandasql) (1.23.2)
Requirement already satisfied: pandas in c:\users\jeffrey.verdiere\documents\sujet centrale info\venv\lib\site-packages (from pandasql) (1.4.3)
Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.40-cp39-cp39-win_amd64.whl (1.6 MB)
     ---------------------------------------- 1.6/1.6 MB 3.4 MB/s eta 0:00:00
Requirement already satisfied: pytz>=2020.1 in c:\users\jeffrey.verdiere\documents\sujet centrale info\venv\lib\site-packages (from pandas->pandasql) (2022.2.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\jeffrey.verdiere\documents\sujet centrale info\venv\lib\site-packages (from pandas->pandasql) (2.8.2)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp39-cp39-win_amd64.whl (101 kB)
     ---------------------------------------- 101.9/101.9 KB ? eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\jeffrey.verdiere\documents\sujet centrale info\venv\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Using legacy 'setup.py install' for pandasql, since package 'wheel' is not installed.
Installing collected packages: greenlet, sqlalchemy, pandasql
  Running setup.py install for pandasql: started
  Running setup.py install for pandasql: finished with status 'done'
Successfully installed greenlet-1.1.2 pandasql-0.7.3 sqlalchemy-1.4.40

WARNING: You are using pip version 22.0.4; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\jeffrey.verdiere\Documents\Sujet centrale info\venv\Scripts\python.exe -m pip install --upgrade pip' command.

In [59]:
from pandasql import sqldf

**0) Petits rappel sur SQL**

Création de la table prof

In [71]:
Id = [1,2,3,4,5,6]
Nom = ['Ferriere','Bregeaut','Ducoat','Rohart','Daniel','Lisles']
Prenom = ['Eve','Diale','Jerome','Vincent','Teddy']
Tel = ['06-02','06-02','06-02','06-02','06-02','06-02']
Salle = [28,29,30,31,40,47]
Cle_primaire = 'Id'

table_prof = pd.DataFrame(list(zip(Id,Nom,Prenom,Tel,Salle)),
                         columns =['Id', 'Nom','Prenom','Tel','Salle'])
table_prof

   Id       Nom   Prenom    Tel  Salle
0   1  Ferriere      Eve  06-02     28
1   2  Bregeaut    Diale  06-02     29
2   3    Ducoat   Jerome  06-02     30
3   4    Rohart  Vincent  06-02     31
4   5    Daniel    Teddy  06-02     40

Création de la table élèves

In [87]:
id = [40,41,42,43,44,45]
Nom = ['Verdiere','laine','tixier','Chevallier','chatillon','Aboville']
Prenom = ['Jeffrey','romain','maxime','jules','louis']
Adresse = ['27 aven roche','122 rue Neu','130 rue sal','29 rue dia','34 ave ou','27 rue jou']
CP = ['92300','7500','92200','93300','91200','93300']
Ville = ['Levallois','Neuilly','Plessy','Cannes','Nice','Nice']
Tel = ['06-02','06-02','06-02','06-02','06-02','06-02']
Num_prof = [1,2,3,4,5,6]

Cle_etrangere = Num_prof 

table_eleve = pd.DataFrame(list(zip(id,Nom,Prenom,Adresse,CP,Ville,Tel,Num_prof)),
                         columns =['Id', 'Nom','Prenom','Adresse','CP','Ville','Tel','Num_prof'])
table_eleve

   Id         Nom   Prenom        Adresse     CP      Ville    Tel  Num_prof
0  40    Verdiere  Jeffrey  27 aven roche  92300  Levallois  06-02         1
1  41       laine   romain    122 rue Neu   7500    Neuilly  06-02         2
2  42      tixier   maxime    130 rue sal  92200     Plessy  06-02         3
3  43  Chevallier    jules     29 rue dia  93300     Cannes  06-02         4
4  44   chatillon    louis      34 ave ou  91200       Nice  06-02         5

**Petits exemples de requettes SQL**

**La selection**

Afficher l'ensemble des informations sur les élèves

In [88]:
q = """SELECT *
    FROM table_eleve
       """

names = pysqldf(q)
names

   Id         Nom   Prenom        Adresse     CP      Ville    Tel  Num_prof
0  40    Verdiere  Jeffrey  27 aven roche  92300  Levallois  06-02         1
1  41       laine   romain    122 rue Neu   7500    Neuilly  06-02         2
2  42      tixier   maxime    130 rue sal  92200     Plessy  06-02         3
3  43  Chevallier    jules     29 rue dia  93300     Cannes  06-02         4
4  44   chatillon    louis      34 ave ou  91200       Nice  06-02         5

Afficher le nom et les prénoms des élèves

In [89]:
q = """SELECT Nom, Prenom
    FROM table_eleve
       """

names = pysqldf(q)
names

          Nom   Prenom
0    Verdiere  Jeffrey
1       laine   romain
2      tixier   maxime
3  Chevallier    jules
4   chatillon    louis

Afficher les villes dans lesquelles habitent les élèves

In [90]:
q = """SELECT DISTINCT Ville
    FROM table_eleve
       """

names = pysqldf(q)
names

       Ville
0  Levallois
1    Neuilly
2     Plessy
3     Cannes
4       Nice

La commande DISTINCT permet de supprimer les doublons

**La selection**

Afficher le nom et les prénoms des élèves qui habitent à Nice.

In [92]:
q = """SELECT  Nom, Prenom
    FROM table_eleve
    WHERE Ville='Nice'
       """

names = pysqldf(q)
names

         Nom Prenom
0  chatillon  louis

Afficher le nom et les numéros de téléphone des élèves qui habitent à Nice ou à Cannes.

In [96]:
q = """SELECT  Nom, Tel
    FROM table_eleve
    WHERE Ville LIKE'Nice' or Ville LIKE'Cannes'
       """

names = pysqldf(q)
names

          Nom    Tel
0  Chevallier  06-02
1   chatillon  06-02

On aurait pu utiliser les = à la place des LIKE, on aurait exactement le même résultat.

Afficher le nom et le prénom des élèves dont le numéro de téléphone commence par 06 et dont la première lettre du nom est comprise entre A et M.

In [98]:
q = """SELECT  Nom, Prenom
    FROM table_eleve
    WHERE Tel LIKE '06%' AND Nom BETWEEN 'A' AND 'M'
       """

names = pysqldf(q)
names

          Nom Prenom
0  Chevallier  jules

**La jointure**

On fait la jointure entre les deux tables.

In [100]:
table_eleve

   Id         Nom   Prenom        Adresse     CP      Ville    Tel  Num_prof
0  40    Verdiere  Jeffrey  27 aven roche  92300  Levallois  06-02         1
1  41       laine   romain    122 rue Neu   7500    Neuilly  06-02         2
2  42      tixier   maxime    130 rue sal  92200     Plessy  06-02         3
3  43  Chevallier    jules     29 rue dia  93300     Cannes  06-02         4
4  44   chatillon    louis      34 ave ou  91200       Nice  06-02         5

Afficher le nom des élèves et la salle où aura lieu le cours avec Monsieur Rohart.

In [107]:
q = """ SELECT table_prof.Salle
FROM table_prof
"""

names = pysqldf(q)
names

   Salle
0     28
1     29
2     30
3     31
4     40

In [139]:
q = """SELECT table_eleve.Nom, table_prof.Salle FROM 
table_eleve JOIN table_prof ON table_eleve.Num_prof=table_prof.id WHERE table_prof.Nom = "Rohart"
"""


names = pysqldf(q)
names

          Nom  Salle
0  Chevallier     31

**Le champ calculé**

Création de la table note.

In [109]:
Id = [1,2,3,4,5,6]
Maths = [17,18,19,20,5,4]
Physique = [8,9,11,12,5,6]
SI = [10,8,14,11,7,11]

table_note = pd.DataFrame(list(zip(Id,Maths,Physique,SI)),
                         columns =['Id', 'Maths','Physique','SI'])
table_note

   Id  Maths  Physique  SI
0   1     17         8  10
1   2     18         9   8
2   3     19        11  14
3   4     20        12  11
4   5      5         5   7
5   6      4         6  11

Afficher l'identifiant des copies avec la note de maths coefficienté par 5.

In [111]:
q = """SELECT table_note.Id, table_note.Maths*5 AS Points_Maths
    FROM table_note
"""


names = pysqldf(q)
names

   Id  Points_Maths
0   1            85
1   2            90
2   3            95
3   4           100
4   5            25
5   6            20

Compter le nombre de copies dont la note de physique est supérieure à 8.

In [112]:
q = """SELECT COUNT(table_note.ID) AS Nombre_copies 
    FROM table_note WHERE table_note.Physique >8
"""


names = pysqldf(q)
names

   Nombre_copies
0              3

Additionner les valeurs d'un champs numériques

In [113]:
q = """SELECT SUM(table_note.Maths) AS Somme_note_maths 
    FROM table_note
"""


names = pysqldf(q)
names

   Somme_note_maths
0                83

Calculer la moyenne des notes de maths

In [115]:
q = """SELECT AVG(table_note.Maths) AS moyenne_note_maths 
    FROM table_note
"""


names = pysqldf(q)
names

   moyenne_note_maths
0           13.833333

Calcul des notes maximales et minimales en maths

In [116]:
q1 = """SELECT MIN(table_note.Maths) AS minimum_note_maths 
    FROM table_note
"""

q2 = """SELECT MAX(table_note.Maths) AS maximum_note_maths 
    FROM table_note
"""

name1 = pysqldf(q1)
name2 = pysqldf(q2)
print(name1)
print(name2)

   minimum_note_maths
0                   4
   maximum_note_maths
0                  20

**La clause groupby**

Creation de la table note

In [120]:
Id = [1,2,3,4,5,6]
Maths = [17,18,19,20,5,4]
Physique = [8,9,11,12,5,6]
SI = [10,8,14,11,7,11]
Classe = ['PC','PT','PT','PC','PT','PC']

table_note = pd.DataFrame(list(zip(Id,Maths,Physique,SI,Classe)),
                         columns =['Id', 'Maths','Physique','SI','Classe'])
table_note

   Id  Maths  Physique  SI Classe
0   1     17         8  10     PC
1   2     18         9   8     PT
2   3     19        11  14     PT
3   4     20        12  11     PC
4   5      5         5   7     PT
5   6      4         6  11     PC

Requette affichant la classe avec la note maximal de maths dans chaque classe.

In [121]:
q = """SELECT Classe, MAX(Maths) 
    FROM table_note
    GROUP BY Classe
"""


names = pysqldf(q)
names

  Classe  MAX(Maths)
0     PC          20
1     PT          19

**I) Plan de vol**

**creation des tables**

In [46]:
id_vol = ['AF1204','AF1205','AF1504','AF1505']
depart = ['CDG','FCO','CDG','FCO']
arrivee = ['FCO','CDG','FCO','CDG']
jour = ['2016-05-02','2016-05-02','2016-05-02','2016-05-02']
heure = ['07:35','10:25','10:05','13:00']
niveau = [300,300,310,310]

**Table vol**

In [47]:
table_vol = pd.DataFrame(list(zip(id_vol,depart,arrivee,jour,heure,niveau)),
                         columns =['id_vol', 'depart','arrivee','jour','heure','niveau'])
table_vol

   id_vol depart arrivee        jour  heure  niveau
0  AF1204    CDG     FCO  2016-05-02  07:35     300
1  AF1205    FCO     CDG  2016-05-02  10:25     300
2  AF1504    CDG     FCO  2016-05-02  10:05     310
3  AF1505    FCO     CDG  2016-05-02  13:00     310

**Table aeroport**

In [48]:
id_aero = ['CDG','ORY','MRS','FCO']
ville = ['Paris','Paris','Marseille','Rome']
pays = ['France','France','France','France']

table_aeroport = pd.DataFrame(list(zip(id_aero,ville,pays)),
               columns =['id_aero','ville','pays'])
table_aeroport

  id_aero      ville    pays
0     CDG      Paris  France
1     ORY      Paris  France
2     MRS  Marseille  France
3     FCO       Rome  France

**Q1:** Ecrire une requette SQL qui fournit le nombre de vols qui doivent décoller dans la journée du 2 mai 2016 avant midi.

In [49]:
table_vol[(table_vol['jour']=='2016-05-02') & (table_vol['heure']<'12:00')]

   id_vol depart arrivee        jour  heure  niveau
0  AF1204    CDG     FCO  2016-05-02  07:35     300
1  AF1205    FCO     CDG  2016-05-02  10:25     300
2  AF1504    CDG     FCO  2016-05-02  10:05     310

In [50]:
len(table_vol[(table_vol['jour']=='2016-05-02') & (table_vol['heure']<'12:00')])

3

En **SQL**

In [68]:
q = """SELECT COUNT(id_vol) FROM table_vol WHERE jour = "2016-05-02" AND heure<"12:00" 
       """

names = pysqldf(q)
names

   COUNT(id_vol)
0              3

**Q2**: Ecrire une requête SQL qui fournit la liste des numéros de vols au départ d'un aéroport desservant Paris le 2 mai 2016.

In [51]:
table_vols = table_vol
table_vols['id_aero'] = table_vol['arrivee']
table_vols

   id_vol depart arrivee        jour  heure  niveau id_aero
0  AF1204    CDG     FCO  2016-05-02  07:35     300     FCO
1  AF1205    FCO     CDG  2016-05-02  10:25     300     CDG
2  AF1504    CDG     FCO  2016-05-02  10:05     310     FCO
3  AF1505    FCO     CDG  2016-05-02  13:00     310     CDG

In [52]:
table_aero

  id_aero      ville    pays
0     CDG      Paris  France
1     ORY      Paris  France
2     MRS  Marseille  France
3     FCO       Rome  France

In [53]:
jointure = pd.merge(table_vols,
                 table_aero,
                 on='id_aero', 
                 how='left')

In [54]:
jointure

   id_vol depart arrivee        jour  heure  niveau id_aero  ville    pays
0  AF1204    CDG     FCO  2016-05-02  07:35     300     FCO   Rome  France
1  AF1205    FCO     CDG  2016-05-02  10:25     300     CDG  Paris  France
2  AF1504    CDG     FCO  2016-05-02  10:05     310     FCO   Rome  France
3  AF1505    FCO     CDG  2016-05-02  13:00     310     CDG  Paris  France

In [55]:
resultat = jointure[(jointure['ville']=='Paris') & (jointure['jour']=='2016-05-02')]
resultat

   id_vol depart arrivee        jour  heure  niveau id_aero  ville    pays
1  AF1205    FCO     CDG  2016-05-02  10:25     300     CDG  Paris  France
3  AF1505    FCO     CDG  2016-05-02  13:00     310     CDG  Paris  France

**Q3** : Que fais la requette suivante:

Elle renvoie les vols internes à la France le 2 mai 2016.

**Q4**: Certains vols peuvent engendrer des conflits potentiels: c'est le cas lorsque deux avions suivent le même trajet, en sens inverse, le même jour et à un même niveau. Faire une requette SQL identifiant les avions étant dans ce cas.

In [56]:
table_vol

   id_vol depart arrivee        jour  heure  niveau id_aero
0  AF1204    CDG     FCO  2016-05-02  07:35     300     FCO
1  AF1205    FCO     CDG  2016-05-02  10:25     300     CDG
2  AF1504    CDG     FCO  2016-05-02  10:05     310     FCO
3  AF1505    FCO     CDG  2016-05-02  13:00     310     CDG

In [57]:
table_vol[table_vol['depart']==table_vol['arrivee']]

Empty DataFrame
Columns: [id_vol, depart, arrivee, jour, heure, niveau, id_aero]
Index: []

In [ ]:
table_vol[table_vol]

In [61]:
pysqldf = lambda q: sqldf(q, globals())

In [66]:
q = """SELECT id_vol 
           FROM table_vol 
       """

names = pysqldf(q)
names

   id_vol
0  AF1204
1  AF1205
2  AF1504
3  AF1505

**Ecriture des requettes en SQL**

In [124]:
table_vol

   id_vol depart arrivee        jour  heure  niveau id_aero
0  AF1204    CDG     FCO  2016-05-02  07:35     300     FCO
1  AF1205    FCO     CDG  2016-05-02  10:25     300     CDG
2  AF1504    CDG     FCO  2016-05-02  10:05     310     FCO
3  AF1505    FCO     CDG  2016-05-02  13:00     310     CDG

In [125]:
table_aeroport

  id_aero      ville    pays
0     CDG      Paris  France
1     ORY      Paris  France
2     MRS  Marseille  France
3     FCO       Rome  France

Nombre de vols au départ d'un aeroport desservant Paris le 2 mai 2016 avant 12h.

In [132]:
q = """SELECT COUNT(id_vol)
    FROM table_vol
    WHERE jour='2016-05-02' AND heure<'12:00'
       """

names = pysqldf(q)
names

   COUNT(id_vol)
0              3

Liste des numéros de vols au départ d'un aeroport desservant Paris le 2 mai 2016.

In [144]:
q = """SELECT id_vol
    FROM table_vol JOIN table_aeroport ON table_vol.arrivee = table_aeroport.id_aero
    WHERE ville = "Paris" AND jour = '2016-05-02'
    
       """

names = pysqldf(q)
names

   id_vol
0  AF1205
1  AF1505

Selection des vols domestiques pour le 2 mai 2016

In [145]:
table_vol

   id_vol depart arrivee        jour  heure  niveau id_aero
0  AF1204    CDG     FCO  2016-05-02  07:35     300     FCO
1  AF1205    FCO     CDG  2016-05-02  10:25     300     CDG
2  AF1504    CDG     FCO  2016-05-02  10:05     310     FCO
3  AF1505    FCO     CDG  2016-05-02  13:00     310     CDG

In [157]:
table_aeroport

  id_aero      ville    pays
0     CDG      Paris  France
1     ORY      Paris  France
2     MRS  Marseille  France
3     FCO       Rome  France

In [170]:
q = """
    SELECT id_vol
    FROM table_vol 
        JOIN table_aeroport AS a ON table_vol.arrivee = a.id_aero
        JOIN table_aeroport AS d ON table_vol.depart = d.id_aero
        WHERE
         d.pays='France' AND a.pays='France' AND jour='2016-05-02'
    
    
       """

names = pysqldf(q)
names

   id_vol
0  AF1204
1  AF1205
2  AF1504
3  AF1505

Requette SQL des avions sur le meme trajet en sens inverse, le même jour et à un même niveau.

In [177]:
q = """
    SELECT vol1.id_vol AS Id1, vol2.id_vol AS Id2
    FROM table_vol AS vol1, table_vol AS vol2
    
    WHERE vol1.niveau = vol2.niveau AND vol1.depart = vol2.arrivee AND vol1.jour = vol2.jour AND ID1>ID2
       """

names = pysqldf(q)
names

      Id1     Id2
0  AF1205  AF1204
1  AF1505  AF1504

# II) Allocation des niveaux de vols

In [227]:
conflit = [[0,0,0,100,100,0,0,150,0],
          [0,0,0,0,0,50,0,0,0],
          [0,0,0,0,200,0,0,300,50],
          [100,0,0,0,0,0,400,0,0],
           [100,0,200,0,0,0,200,0,100],
          [0,50,0,0,0,0,0,0,0],
          [0,0,0,400,200,0,0,0,0],
          [150,0,300,0,0,0,0,0,0],
          [0,0,50,0,100,0,0,0,0]]

In [228]:
def nb_conflit():
    a = 0 #On initialise le nombre de conflits
    for i in range(len(conflit)):
        for j in range(len(conflit[0])):
            if conflit[i][j]==0:
                a+=1
    return(a)

nb_conflit()

61

La complexité de l'algorithme est en O(n**2)

**II) Regulation**

On a une liste de regulation r=0: RFL r=1: au-dessus r=2: au-dessous

In [229]:
regulation = [0,0,0,0,0,0,1,1,1,1,2,2,2,1,0,2,1]

In [230]:
def nb_vol_par_regulation(regulation):
    a = sum(x==0 for x in regulation)
    b = sum(x==1 for x in regulation)
    c = sum(x==2 for x in regulation)
    return([a,b,c])

In [231]:
nb_vol_par_regulation(regulation)

[7, 6, 4]

In [232]:
def nb_vol_par_regulation1(regulation):
    a = 0
    b = 0
    c = 0
    for i in range(len(regulation)):
        if regulation[i]==0:
            a+=1
        if regulation[i]==1:
            b+=1
        if regulation[i]==2:
            c+=1
    return([a,b,c])

In [233]:
nb_vol_par_regulation1(regulation)

[7, 6, 4]

In [234]:
2//3

0

In [235]:
2/3

0.6666666666666666

On a construit la matrice de conflit contenant les couts. On veut une fonction cout_regulation qui prend en paramètre une liste de régulation et renvoie le cout associé.

In [251]:
def cout_regulation(regulation):
    L= [] # Liste qui va contenir les sommets associés à chaque vol
    cout=0 #Initialisation du cout 
    for k in range(len(regulation)):
        L.append(3*k+regulation[k])#On calcule le sommet de chaque vol. Il vaudrait mieux faire une liste en compréhension.
    for i in L:
        for j in L:
            cout+=conflit[i][j]
    #La matrice est symétrique: il faut faire attention
    return(cout/2)

In [255]:
regulation = [0,0,1]

In [253]:
cout_regulation(regulation)

250.0

On préfère utiliser les listes en compréhension pour construire des listes.

In [254]:
def cout_regulation1(regulation):
     # sommets Liste qui va contenir les sommets associés à chaque vol
    cout=0 #Initialisation du cout 
    sommets = [3*k+regulation[k] for k in range(len(regulation))]
    for i in sommets:
        for j in sommets:
            cout+=conflit[i][j]
    #La matrice est symétrique: il faut faire attention
    return(cout/2)

In [256]:
cout_regulation1(regulation)

250.0

Déduire une fonction cout_RFL() qui renvoie le cout de la régulation pour laquelle chaque avion vole à son RFL.

In [257]:
3//2

1

On veut calculer le cout de la régulation lorsque tous les avions volent à leurs RFL.

In [260]:
def cout_RFL():
    n = len(conflit)//3
    regulation = [0]*n
    return(cout_regulation1(regulation))

In [261]:
cout_RFL()

500.0

**Algorithme minimal**

on veut créer une fonction qui calcule la somme des couts des conflits potentiels dans lequel ce sommet intervient. Algo minimal consiste à trouver le sommet du graphe de cout minimal. Une fois ce dernier trouvé, les deux autres niveaux possibles sont supprimés du graphe et on recommence avec ce nouveau graphe jusqu'à avoir attribué un niveau à chaque vol.
Dans la pratique, plutot que de réellement supprimer ces sommets on utilise une liste etat_sommet de 3n entiers tel que:
- etat_sommet(s) vaut 0 lorsque le sommet s a été supprimé du graphe
- etat_sommet(s) vaut 1 lorsque le sommet s a été choisi dans la régulation
- etat_sommet(s) vaut 2 dans les 2 autres cas

On a 3 vols donc on a en réalité 3 sommets pour chaque vol donc une liste à 9 éléments.

La matrice conflit est une variable dans l'algorithme.

In [269]:
etat_sommet = [0,1,2,0,1,2,0,1,2]

In [272]:
def cout_du_sommet(s,etat_sommet):
    L = [conflit[s][i] for i in range(len(etat_sommet)) if etat_sommet[i]!=0]
    return(sum(L))

In [273]:
cout_du_sommet(1,etat_sommet)

50

In [274]:
L = [1,2,3]

In [285]:
def sommet_de_cout_min(etat_sommet):
    cout_min = float("inf") #Initialisation du cout à la valeur infinie
    for s in range(len(etat_sommet)):
        if etat_sommet[s]==2:
            cout = cout_du_sommet(s,etat_sommet)
            if cout < cout_min:
                cout_min = cout
                rang = s
    return(rang)

In [286]:
sommet_de_cout_min(etat_sommet)

5